{
  "backend/main.mo": "Main backend actor implementing a social media platform with user profiles, follow system, stories, reels, and messaging using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: user authentication, chat messaging, stories, reels, and follow system with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including authentication, profile management, stories, reels, chat, and navigation with technical implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining the application's design system.",
  "frontend/index.html": "HTML entry point for the Social Connect application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, authentication guards, route definitions, theme provider, and profile setup modal integration.",
  "frontend/src/components/AddReelModal.tsx": "Modal component for uploading video reels with file selection, preview, caption input, and upload progress tracking using ExternalBlob.",
  "frontend/src/components/AddStoryModal.tsx": "Modal dialog for uploading and posting image stories with file selection, preview, upload progress tracking, and submission using the useAddStory mutation hook.",
  "frontend/src/components/ChatThread.tsx": "Displays a chat conversation thread with another user, showing messages in chronological order with timestamps and a message input component at the bottom.",
  "frontend/src/components/ConversationList.tsx": "Lists chat conversations with profile pictures and user info; currently shows empty state placeholder as backend conversation fetching is not implemented.",
  "frontend/src/components/EditProfileModal.tsx": "Modal form for editing user profile including username, display name, bio, and profile picture with image upload and progress tracking.",
  "frontend/src/components/EmptyState.tsx": "Reusable component that displays a placeholder image and message for empty data states throughout the application.",
  "frontend/src/components/FollowButton.tsx": "Toggle button for following/unfollowing users, showing current follow state and handling follow/unfollow mutations with loading states.",
  "frontend/src/components/FollowersModal.tsx": "Modal dialog that displays a scrollable list of users who follow a given principal with links to their profiles.",
  "frontend/src/components/FollowingModal.tsx": "Modal dialog that displays a scrollable list of users that a given principal is following with links to their profiles.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, desktop navigation, mobile bottom navigation bar, and footer; includes app logo and navigation to Home, Explore, Reels, Chat, and Profile sections.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, with loading indicators and query cache clearing on logout.",
  "frontend/src/components/MessageInput.tsx": "A form component for sending messages to a recipient Principal, with input validation and error handling via toast notifications.",
  "frontend/src/components/ProfilePicture.tsx": "Displays a user's profile picture avatar with configurable sizes (sm/md/lg/xl), falling back to a default avatar or user icon if no picture is provided.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for new users to set up their profile with username, display name, bio, and profile picture upload with progress tracking.",
  "frontend/src/components/ReelCard.tsx": "Displays a video reel card with author info, timestamp, video player, caption, and delete button for the reel owner.",
  "frontend/src/components/StoriesBar.tsx": "A horizontal scrollable bar showing story circles for the current user and others, with modals for adding new stories and viewing existing ones.",
  "frontend/src/components/StoryViewer.tsx": "A full-screen modal for viewing stories with progress bars, navigation between multiple stories from the same author, and auto-advance functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, follow system, stories, reels, and messaging functionality using TanStack Query and the backend actor. Provides queries and mutations with automatic cache invalidation for all social media features.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using coral primary and teal secondary colors. Defines CSS variables for consistent styling across the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat page component with a two-column layout displaying a conversation list and chat thread. Shows empty state when no conversation is selected.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page with tabbed interface for browsing all reels and stories. Includes story viewer modal and grid layouts for media content.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a stories bar and feed of latest reels with user profiles and timestamps. Shows loading states and empty state when no content exists.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing profile info, stats, reels grid, and action buttons. Handles both own profile (with edit) and other users' profiles (with follow/message buttons).",
  "frontend/src/pages/ReelsPage.tsx": "Reels page displaying all reels in a feed with an add reel button. Includes modal for creating new reels and shows loading/empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH color space, extended animations (accordion, fade-in, slide-up), custom shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining an Instagram-like social media app with features including user authentication, chat messaging, stories, reels, follow system, and home feed; includes architectural notes, image requirements, and existing feature definitions."
}